---
kind: property
id: P:Autodesk.Revit.DB.PlanCircuitSet.Size
source: html/ba5dcbc8-aa9d-087f-290c-e72654138a08.htm
---
# Autodesk.Revit.DB.PlanCircuitSet.Size Property

Returns the number of objects that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```